<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 数据库类型
    'type'           => '\think\mongo\Connection',
    // 服务器地址
    'hostname'       => '127.0.0.1',
    
    'username'       =>'',
    'password'       =>'',
    // 数据库名
    'database'       => 'demo',
    // 端口
    'hostport'       => '27017',
];
